"""5. Реализовать класс Stationery (канцелярская принадлежность).
определить в нём атрибут title (название) и метод draw (отрисовка). Метод выводит сообщение «Запуск отрисовки»;
создать три дочерних класса Pen (ручка), Pencil (карандаш), Handle (маркер);
в каждом классе реализовать переопределение метода draw. Для каждого класса метод должен выводить уникальное сообщение;"""


class Stationery:
    def __init__(self, title):
        self.title = title

    def draw(self):
        print(f'Запуск отрисовки {self.title}')


class Pen(Stationery):
    def draw(self):
        print(f'рисование: {self.title}')


class Pencil(Stationery):
    def draw(self):
        print(f'рисование: {self.title}')


pen_1 = Pen('ручка')
pen_1.draw()

pencil_1 = Pencil('карандаш')
pencil_1.draw()
